[
    {
    "title": "Whiplash",
    "date": "2014-10-10",
    "overview": "Under the direction of a ruthless instructor, a talented young drummer begins to pursue perfection at any cost, even his humanity.",
    "vote": 11342,
    "avgVote": 8.4,
    "src": "https://image.tmdb.org/t/p/original/oPxnRhyAIzJKGUEdSiwTJQBa3NM.jpg"
    },
    {
    "title": "Whiplash",
    "date": "2013-01-18",
    "overview": "A ferocious, bullying music teacher teaches a dedicated student. This is the 18 min short film that the feature film was based on.",
    "vote": 214,
    "avgVote": 7.9,
    "src": "https://image.tmdb.org/t/p/original/1FWxESqVtnc4N1274x0uVSph3S4.jpg"
    },
    {
    "title": "In Profile - Mikey Whiplash - Life, Death & Resurrection",
    "date": "2015-08-19",
    "overview": "Part 1 of 3 of a long-form interview with Mikey Whiplash.",
    "vote": 0,
    "avgVote": 0,
    "src": "https://image.tmdb.org/t/p/originalnull"
    },
    {
    "title": "Whiplash",
    "date": "1974-07-05",
    "overview": "The Empress Dowager flees when the allied forces descend upon the capital. During an attack by bandits, her jewels are lost in the mountains. Ten years later, a local villager finds the treasure. When news of the found jewels spreads, a group of bandits descends upon the town hoping to find the treasure, but first they’ll have to deal with the villager’s daughter, Tigress (Pei-Pei Cheng), who is quite dangerous due to her amazing fighting skills.",
    "vote": 0,
    "avgVote": 0,
    "src": "https://image.tmdb.org/t/p/original/9myRgABFEHuc38yGZUX34oVGVE1.jpg"
    },
    {
    "title": "Whiplash of the Dead",
    "date": "2021-04-16",
    "overview": "The documentary on Yamazaki Hiroaki, the student died in the First Haneda Incident of 8 October 1967.",
    "vote": 1,
    "avgVote": 8,
    "src": "https://image.tmdb.org/t/p/original/2wqEaDI19CAEXWKIuZwXVD6pu30.jpg"
    },
    {
    "title": "The Evil Within",
    "date": "2017-06-13",
    "overview": "The sadistic tale of a lonely, mentally handicapped boy who befriends his reflection in an antique mirror. This demonic creature orders him to go on a murderous rampage to kill the people he loves most.",
    "vote": 67,
    "avgVote": 6,
    "src": "https://image.tmdb.org/t/p/original/2PTfanA2YsdKUgbw27mtZ2E98QW.jpg"
    },
    {
    "title": "The Fiend of Dope Island",
    "date": "1961-01-01",
    "overview": "Charlie is a dope smuggler who lives on his own private desert island and rules over the natives with an iron fist.  When the native stooges get out of line, Charlie literally cracks the whip on his insubordinate subordinates.  When a sexpot named Glory comes to the island, he holds her prisoner and makes her go-go dance for him.",
    "vote": 1,
    "avgVote": 4,
    "src": "https://image.tmdb.org/t/p/originalnull"
    },
    {
    "title": "Whiplashed",
    "date": "2008-09-20",
    "overview": "A man wakes up in a crashed car. He has lost his memory and the woman behind the wheel is dead. In the hospital fragments of his memory come back to him in sharp disturbing flashes. He discovers he was involved in some dirty scheme and is not as innocent as he hoped to be.",
    "vote": 0,
    "avgVote": 0,
    "src": "https://image.tmdb.org/t/p/originalnull"
    }
    ]